alpri0265/STM32F407ZET6-MODUL-1/Src/screens.c
#include "screens.h"
#include "lcd.h"
#include "system_state.h"
#include "menu.h"
#include "encoder_menu.h"
#include "bringup_config.h"
#include "main.h"
#include "system_config.h"
#include "fault.h"
#include "axis_feedback.h"
#include "temperature.h"
#include "tool_angle.h"
#include "board.h"
#include "adc_if.h"
#include "jog.h"
#include "sl_limits.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#define MENU_LINE_PREFIX "  "
#define MENU_LINE_SEL    "> "
#define LINE_LEN         20

static bool menu_need_redraw;

/* Режим введення куту вручну на екрані Tool angle; value в десятих (0-3599), cursor 0-3 (сотні, десятки, одиниці, десяті) */
static bool tool_angle_edit_mode;
static unsigned int tool_angle_edit_value;
static unsigned int tool_angle_edit_cursor;

static void render_list_screen(void)
{
    lcd_clear();
    unsigned int n = menu_get_count();
    unsigned int sel = menu_get_selected();
    /* Прокрутка: якщо пунктів > 4, показуємо вікно з 4 рядків так, щоб курсор був видно */
    unsigned int first = 0u;
    if (n > 4u) {
        first = (sel >= 3u) ? (sel - 3u) : 0u;
        if (first + 4u > n) first = n - 4u;
    }
    char buf[LINE_LEN + 4];
    for (unsigned int i = 0; i < 4u; i++) {
        unsigned int idx = first + i;
        if (idx < n) {
            const char *prefix = (idx == sel) ? MENU_LINE_SEL : MENU_LINE_PREFIX;
            const char *p = menu_get_item_text(idx);
            (void)snprintf(buf, sizeof(buf), "%s%-16s", prefix, p);
        } else
            (void)snprintf(buf, sizeof(buf), "                    ");
        buf[LINE_LEN] = '\0';
        lcd_print_line((uint8_t)i, buf);
    }
}

static void render_info_jog(void)
{
    float x_mm = 0.0f, z_mm = 0.0f;
    jog_get_pos_mm(&x_mm, &z_mm);
    unsigned int ju, jd, jl, jr, rapid;
    uint32_t steps_x, steps_z;
    jog_get_joy_state(&ju, &jd, &jl, &jr);
    jog_get_step_counts(&steps_x, &steps_z);
    jog_get_rapid_state(&rapid);
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "                    ");
    (void)snprintf(buf, sizeof(buf), "X: %.2f StX:%lu    ", (double)x_mm, (unsigned long)steps_x);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "Z: %.2f StZ:%lu    ", (double)z_mm, (unsigned long)steps_z);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    (void)snprintf(buf, sizeof(buf), "U%u D%u L%u R%u *%u Up=Bk", ju, jd, jl, jr, rapid);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

static void render_info_feed_manual(void)
{
    uint16_t feed_raw = adc_if_read(ADC_CH_FEED_OVERRIDE);
    unsigned int feed_pct = 30u + ((unsigned)feed_raw * 120u) / 4095u;
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Manual feed        ");
    (void)snprintf(buf, sizeof(buf), "Pot: %u%%           ", feed_pct);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    lcd_print_line(2, "PA4 potentiometer  ");
    lcd_print_line(3, "[Back]             ");
}

static void render_info_feed_auto(void)
{
    float x_mm = 0.0f, z_mm = 0.0f;
    jog_get_pos_mm(&x_mm, &z_mm);
    bool x_ok = sl_limits_x_taught();
    bool z_ok = sl_limits_z_taught();
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Feed Auto: X Z     ");
    (void)snprintf(buf, sizeof(buf), "X:%.1f Z:%.1f mm   ", (double)x_mm, (double)z_mm);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "X%c Z%c UDLR=move  ", x_ok ? '+' : '-', z_ok ? '+' : '-');
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    lcd_print_line(3, "SL btn=teach [Back]");
}

static void render_info_axis_x(void)
{
    const axis_cfg_t *c = system_axis_cfg(AXIS_X);
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Axis X             ");
    (void)snprintf(buf, sizeof(buf), "steps/mm: %.0f    ", (double)c->steps_per_mm);
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "max feed: %.0f   ", (double)c->max_feed);
    lcd_print_line(2, buf);
    (void)snprintf(buf, sizeof(buf), "min %.0f max %.0f ", (double)c->min_mm, (double)c->max_mm);
    lcd_print_line(3, buf);
}

static void render_info_axis_z(void)
{
    const axis_cfg_t *c = system_axis_cfg(AXIS_Z);
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Axis Z             ");
    (void)snprintf(buf, sizeof(buf), "steps/mm: %.0f    ", (double)c->steps_per_mm);
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "max feed: %.0f   ", (double)c->max_feed);
    lcd_print_line(2, buf);
    (void)snprintf(buf, sizeof(buf), "min %.0f max %.0f ", (double)c->min_mm, (double)c->max_mm);
    lcd_print_line(3, buf);
}

static void render_info_spindle(void)
{
    lcd_print_line(0, "Spindle settings   ");
    lcd_print_line(1, "PWM / RPM          ");
    lcd_print_line(2, "                   ");
    lcd_print_line(3, "[Back]             ");
}

/* Усі кінцевики — індуктивні NPN: спрацювання = LOW (вихід сенсора в GND) */
static bool limits_read_x_neg(void) { return HAL_GPIO_ReadPin(LIM_X_NEG_GPIO_Port, LIM_X_NEG_Pin) == GPIO_PIN_RESET; }
static bool limits_read_x_pos(void) { return HAL_GPIO_ReadPin(LIM_X_POS_GPIO_Port, LIM_X_POS_Pin) == GPIO_PIN_RESET; }
static bool limits_read_z_neg(void) { return HAL_GPIO_ReadPin(LIM_Z_NEG_GPIO_Port, LIM_Z_NEG_Pin) == GPIO_PIN_RESET; }
static bool limits_read_z_pos(void) { return HAL_GPIO_ReadPin(LIM_Z_POS_GPIO_Port, LIM_Z_POS_Pin) == GPIO_PIN_RESET; }

static void render_info_limits(void)
{
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Limits status      ");
    lcd_print_line(1, "X-  X+  Z-  Z+     ");
    (void)snprintf(buf, sizeof(buf), " %d   %d   %d   %d       ",
        limits_read_x_neg() ? 1 : 0, limits_read_x_pos() ? 1 : 0,
        limits_read_z_neg() ? 1 : 0, limits_read_z_pos() ? 1 : 0);
    lcd_print_line(2, buf);
    lcd_print_line(3, "[Back]             ");
}

static void render_info_i2c_lcd(void)
{
    lcd_print_line(0, "I2C/LCD test       ");
    lcd_print_line(1, "OK                 ");
    lcd_print_line(2, "addr 0x27          ");
    lcd_print_line(3, "[Back]             ");
}

static void render_info_encoders(void)
{
    float x_mm = axis_feedback_pos_mm(AXIS_X);
    float z_mm = axis_feedback_pos_mm(AXIS_Z);
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Encoders X / Z     ");
    (void)snprintf(buf, sizeof(buf), "X: %.2f mm       ", (double)x_mm);
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "Z: %.2f mm       ", (double)z_mm);
    lcd_print_line(2, buf);
    lcd_print_line(3, "[Back]             ");
}

static void render_info_adc_fault(void)
{
    float t_c = temperature_get_c();
    uint16_t feed_raw = adc_if_read(ADC_CH_FEED_OVERRIDE);
    uint16_t enc_raw = adc_if_read(ADC_CH_TOOL_ANGLE);
    float enc_deg_f = (float)enc_raw * 360.0f / 4095.0f;
    unsigned int enc_d = (unsigned int)enc_deg_f;
    unsigned int enc_t = (unsigned int)(enc_deg_f * 10.0f) % 10u;
    uint16_t fault = fault_get();
    char buf[LINE_LEN + 4];
    unsigned int tc_d = (unsigned int)(t_c < 0.0f ? -t_c : t_c);
    unsigned int tc_t = (unsigned int)((t_c < 0.0f ? -t_c : t_c) * 10.0f) % 10u;
    lcd_print_line(0, "ADC / Fault            ");
    (void)snprintf(buf, sizeof(buf), "T:%s%u.%u C Feed:%u   ", t_c < 0.0f ? "-" : "", tc_d, tc_t, (unsigned)feed_raw);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "Enc: %u.%u %c          ", enc_d, enc_t, 0xFF);
    buf[LINE_LEN] = '\0';
    lcd_print_line_deg(2, buf);
    (void)snprintf(buf, sizeof(buf), "Fault: %u [Back]    ", (unsigned)fault);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

static void render_info_tool_angle_calib(void)
{
    float deg = tool_angle_get_deg();
    unsigned int d = (unsigned int)deg;
    unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
    char buf[LINE_LEN + 4];
    lcd_print_line(0, "Calibrate encoder   ");
    lcd_print_line(1, "Set to 180 deg then ");
    lcd_print_line(2, "Enter=Cal Up=Back   ");
    (void)snprintf(buf, sizeof(buf), "  Now: %u.%u %c      ", d, t, 0xFF);
    buf[LINE_LEN] = '\0';
    lcd_print_line_deg(3, buf);
}

static void render_info_tool_angle(void)
{
    char buf[LINE_LEN + 4];
    if (tool_angle_edit_mode) {
        unsigned int v = tool_angle_edit_value;
        unsigned int h = (v / 10u) / 100u;   /* сотні 0-3 */
        unsigned int t = (v / 10u) / 10u % 10u;
        unsigned int o = (v / 10u) % 10u;
        unsigned int d = v % 10u;             /* десяті */
        (void)snprintf(buf, sizeof(buf), "Set angle (%c)        ", 0xFF);
        buf[LINE_LEN] = '\0';
        lcd_print_line_deg(0, buf);
        (void)snprintf(buf, sizeof(buf), "Set: %u%u%u.%u%c     ", h, t, o, d, 0xFF);
        buf[LINE_LEN] = '\0';
        lcd_print_line_deg(1, buf);
        /* Курсор під розрядом: "Set: " = 5 символів, потім цифри 5,6,7, крапка 8, цифра 9 */
        { char cur[LINE_LEN + 1]; unsigned int i, pos = (tool_angle_edit_cursor < 3u) ? (5u + tool_angle_edit_cursor) : 9u;
          for (i = 0u; i < LINE_LEN; i++) cur[i] = (i == pos) ? '^' : ' ';
          cur[LINE_LEN] = '\0';
          lcd_print_line(2, cur); }
        lcd_print_line(3, "Enter=next Up/Down=+/- ");
    } else {
        float deg = tool_angle_get_deg();
        unsigned int d = (unsigned int)deg;
        unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
        lcd_print_line(0, "  Kut instrumentu      ");
        (void)snprintf(buf, sizeof(buf), "  %u.%u %c            ", d, t, 0xFF);
        buf[LINE_LEN] = '\0';
        lcd_print_line_deg(1, buf);
        lcd_print_line(2, "Enter=Zero Down=Set    ");
        lcd_print_line(3, "Up=Back               ");
    }
}

/* Оновлює тільки рядок з кутом — без перемальовування всього екрану, щоб не мерехтіло */
static void tool_angle_refresh_value_only(void)
{
    float deg = tool_angle_get_deg();
    unsigned int d = (unsigned int)deg;
    unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
    char buf[LINE_LEN + 4];
    (void)snprintf(buf, sizeof(buf), "  %u.%u %c            ", d, t, 0xFF);
    buf[LINE_LEN] = '\0';
    lcd_print_line_deg(1, buf);
}

static const char* state_str(void)
{
    switch (system_state_get()) {
        case SYS_STATE_INIT:  return "INIT ";
        case SYS_STATE_READY: return "READY";
        case SYS_STATE_HOLD:  return "HOLD ";
        case SYS_STATE_ERROR: return "ERROR";
        default: return "?    ";
    }
}

static void render_info_info(void)
{
    char buf[LINE_LEN + 2];
    (void)snprintf(buf, sizeof(buf), "State: %s        ", state_str());
    lcd_print_line(0, buf);
    (void)snprintf(buf, sizeof(buf), "Fault: %u        ", (unsigned)fault_get());
    lcd_print_line(1, buf);
    lcd_print_line(2, "Build bringup      ");
    lcd_print_line(3, "[Back]             ");
}

static void render_info_screen(menu_screen_id_t id)
{
    switch (id) {
        case SCREEN_JOG:       render_info_jog();       break;
        case SCREEN_FEED_MANUAL: render_info_feed_manual(); break;
        case SCREEN_FEED_AUTO:   render_info_feed_auto();   break;
        case SCREEN_AXIS_X:    render_info_axis_x();    break;
        case SCREEN_AXIS_Z:    render_info_axis_z();    break;
        case SCREEN_SPINDLE:   render_info_spindle();   break;
        case SCREEN_I2C_LCD:   render_info_i2c_lcd();   break;
        case SCREEN_ENCODERS:  render_info_encoders();  break;
        case SCREEN_LIMITS:    render_info_limits();    break;
        case SCREEN_ADC_FAULT: render_info_adc_fault();  break;
        case SCREEN_TOOL_ANGLE:     render_info_tool_angle();     break;
        case SCREEN_TOOL_ANGLE_CALIB: render_info_tool_angle_calib(); break;
        case SCREEN_INFO:      render_info_info();      break;
        default:
            lcd_print_line(0, "Unknown screen     ");
            lcd_print_line(1, "                  ");
            lcd_print_line(2, "                  ");
            lcd_print_line(3, "[Back]             ");
            break;
    }
}

static void render_current_screen(void)
{
    menu_screen_id_t cur = menu_current_screen();
    if (menu_screen_type(cur) == MENU_SCREEN_LIST)
        render_list_screen();
    else
        render_info_screen(cur);
}

void screens_init(void)
{
    lcd_init();
#if BRINGUP_MODE
    lcd_clear();
#endif
}

void screens_process(void)
{
#if BRINGUP_MODE
    if (system_state_is(SYS_STATE_READY)) {
        encoder_menu_action_t act = encoder_menu_get_action();
        bool need_render = false;
        menu_screen_id_t cur = menu_current_screen();
        menu_screen_type_t st = menu_screen_type(cur);

        if (cur != SCREEN_TOOL_ANGLE)
            tool_angle_edit_mode = false;

        if (act != ENCODER_MENU_ACTION_NONE) {
            if (cur == SCREEN_TOOL_ANGLE && menu_can_back()) {
                if (tool_angle_edit_mode) {
                    if (act == ENCODER_MENU_ACTION_ENTER) {
                        if (tool_angle_edit_cursor < 3u) {
                            tool_angle_edit_cursor++;
                            need_render = true;
                        } else {
                            tool_angle_set_displayed_deg((float)tool_angle_edit_value / 10.0f);
                            tool_angle_edit_mode = false;
                            need_render = true;
                        }
                    } else if (act == ENCODER_MENU_ACTION_CCW || act == ENCODER_MENU_ACTION_CW) {
                        static const unsigned int place[] = { 1000u, 100u, 10u, 1u };
                        unsigned int step = place[tool_angle_edit_cursor];
                        if (act == ENCODER_MENU_ACTION_CCW) {
                            tool_angle_edit_value += step;
                            if (tool_angle_edit_value > 3599u) tool_angle_edit_value = 3599u;
                        } else {
                            if (tool_angle_edit_value >= step) tool_angle_edit_value -= step;
                            else tool_angle_edit_value = 0u;
                        }
                        need_render = true;
                    }
                } else {
                    if (act == ENCODER_MENU_ACTION_ENTER) {
                        tool_angle_zero();
                        need_render = true;
                    } else if (act == ENCODER_MENU_ACTION_CW) {
                        tool_angle_edit_mode = true;
                        tool_angle_edit_cursor = 0u;
                        {
                            float d = tool_angle_get_deg();
                            if (d < 0.0f) d = 0.0f;
                            if (d >= 360.0f) d = 0.0f;
                            tool_angle_edit_value = (unsigned int)(d * 10.0f + 0.5f);
                            if (tool_angle_edit_value >= 3600u) tool_angle_edit_value = 0u;
                        }
                        need_render = true;
                    } else {
                        menu_back();
                        need_render = true;
                    }
                }
            } else if (cur == SCREEN_TOOL_ANGLE_CALIB && menu_can_back()) {
                if (act == ENCODER_MENU_ACTION_ENTER) {
                    tool_angle_calibrate_180();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CCW) {
                    menu_back();
                    need_render = true;
                }
            } else if ((cur == SCREEN_JOG || cur == SCREEN_FEED_AUTO) && menu_can_back()) {
                if (act == ENCODER_MENU_ACTION_CCW) {
                    menu_back();
                    need_render = true;
                }
                /* Enter і CW — для Jog (перемикання осі, рух), не виходимо */
            } else if (st == MENU_SCREEN_INFO && menu_can_back()) {
                menu_back();
                need_render = true;
            } else if (st == MENU_SCREEN_LIST) {
                if (act == ENCODER_MENU_ACTION_CW) {
                    menu_select_next();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CCW) {
                    menu_select_prev();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_ENTER) {
                    menu_enter();
                    need_render = true;
                }
            }
            /* Завжди скидаємо дію, щоб encoder_menu_process() знову опитував кнопки */
            encoder_menu_clear_action();
        }

        if (!menu_need_redraw) {
            need_render = true;
            menu_need_redraw = true;
        }
        /* ADC/Fault — повне оновлення не частіше раз на 250 мс */
        /* Limits — оновлення кожні 150 мс, щоб кінцевики відображалися в реальному часі */
        {
            static uint32_t last_adc_tick;
            static uint32_t last_limits_tick;
            static uint32_t last_jog_tick;
            uint32_t now = HAL_GetTick();
            if (cur == SCREEN_ADC_FAULT) {
                if ((now - last_adc_tick) >= 250u)
                    need_render = true;
                if (need_render)
                    last_adc_tick = now;
            }
            if (cur == SCREEN_LIMITS) {
                if ((now - last_limits_tick) >= 150u)
                    need_render = true;
                if (need_render)
                    last_limits_tick = now;
            }
            if (cur == SCREEN_JOG || cur == SCREEN_FEED_AUTO) {
                if ((now - last_jog_tick) >= 100u)
                    need_render = true;
                if (need_render)
                    last_jog_tick = now;
            }
            if (cur == SCREEN_FEED_MANUAL) {
                if ((now - last_adc_tick) >= 250u)
                    need_render = true;
                if (need_render)
                    last_adc_tick = now;
            }
        }
        if (need_render)
            render_current_screen();
        /* Кут інструменту: тільки рядок з числом оновлювати раз на 100 мс (не в режимі Set) */
        if (cur == SCREEN_TOOL_ANGLE && !tool_angle_edit_mode) {
            static uint32_t last_tool_tick;
            uint32_t now = HAL_GetTick();
            if ((now - last_tool_tick) >= 100u) {
                tool_angle_refresh_value_only();
                last_tool_tick = now;
            }
        }
        /* Екран калібрування: оновлювати рядок "Now" кожні 100 мс */
        if (cur == SCREEN_TOOL_ANGLE_CALIB) {
            static uint32_t last_calib_tick;
            uint32_t now = HAL_GetTick();
            if ((now - last_calib_tick) >= 100u) {
                float deg = tool_angle_get_deg();
                unsigned int d = (unsigned int)deg;
                unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
                char buf[LINE_LEN + 4];
                (void)snprintf(buf, sizeof(buf), "  Now: %u.%u %c      ", d, t, 0xFF);
                buf[LINE_LEN] = '\0';
                lcd_print_line_deg(3, buf);
                last_calib_tick = now;
            }
        }
    } else {
        menu_need_redraw = false;
        lcd_clear();
        lcd_print_line(0, "INIT...            ");
    }
#else
    switch (system_state_get()) {
        case SYS_STATE_INIT:  lcd_print_line(0, "INIT"); break;
        case SYS_STATE_READY: lcd_print_line(0, "READY"); break;
        case SYS_STATE_HOLD:  lcd_print_line(0, "HOLD"); break;
        case SYS_STATE_ERROR: lcd_print_line(0, "ERROR"); break;
    }
#endif
}
